// pages/news/newsPage.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    newsList: [
      {
        id: 1,
        content: '资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据',
        person: '数据更新人：张晨',
        time: '2020-1-13 08:59'
      },
      {
        id: 2,
        content: '资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据',
        person: '数据更新人：张晨',
        time: '2020-1-13 08:59'
      },
      {
        id: 3,
        content: '资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据',
        person: '数据更新人：张晨',
        time: '2020-1-13 08:59'
      },
      {
        id: 4,
        content: '资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据',
        person: '数据更新人：张晨',
        time: '2020-1-13 08:59'
      },
      {
        id: 5,
        content: '资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据，资方数据更新资方数据更新更新数据',
        person: '数据更新人：张晨',
        time: '2020-1-13 08:59'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})